Tekla Open API Reference for Tekla Structures 2025
OpenGraphicObject.OpenGraphicObjectAttributes Class
 The OpenGraphicObjectAttributes class is the attributes class of the open graphic object.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes
 Tekla.Structures.Drawing.Arc.ArcAttributes
 Tekla.Structures.Drawing.Line.LineAttributes
 Tekla.Structures.Drawing.Polyline.PolylineAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class OpenGraphicObjectAttributes : GraphicObject.GraphicObjectAttributes
<SerializableAttribute>
Public MustInherit Class OpenGraphicObjectAttributes
	Inherits GraphicObject.GraphicObjectAttributes
The OpenGraphicObject.OpenGraphicObjectAttributes type exposes the following members.
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the open graphic object. The end points of an open graphic object can contain arrowheads.
Line
 The line attributes of the graphic object. A graphic object always consists of lines.
 (Inherited from GraphicObject.GraphicObjectAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from AttributesBase.)
LoadAttributes
 Loads the attributes from the specified file.
 (Inherited from AttributesBase.)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace